tap "caskroom/cask"

brew "git"
brew "ghi"
brew "hub"
brew "mas"

brew "yarn", args: ["without-node"]

cask "gpg-suite"
mas "Flycut", id: 442160987

cask "iterm2"
cask "atom"
cask "visual-studio-code"
cask "spectacle"
cask "istat-menus"
cask "github"
cask "keepassx"
mas "Tweetbot", id: 557168941
cask "franz"
mas "The Unarchiver", id: 425424353
# mas "Xcode", id: 497799835

brew "watchman"
brew "terminal-notifier", link: false
brew "cocoapods"
brew "imagemagick"
brew "python"
brew "tree"
tap "lyft/formulae"
brew "lyft/formulae/set-simulator-location"
tap "wix/brew"
brew "wix/brew/applesimutils", args: ["HEAD"]

cask "appcleaner"
cask "imageoptim"
cask "cyberduck"
cask "grandperspective"
cask "discord"
cask "telegram"
cask "signal"
cask "vlc"
cask "iina"
cask "licecap"
cask "name-mangler"
cask "prefs-editor"
cask "jubler"
cask "sketch"
cask "sourcetree"
# cask "syncthing-bar"
cask "teamviewer"
cask "transmission"
cask "tunnelblick"
cask "webtorrent"
mas "JPEGmini Pro", id: 887163276

cask "steam"
cask "libreoffice"
mas "Pixelmator", id: 407963104
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
# mas "Final Cut Pro", id: 424389933

cask "chromium"
cask "firefox"
cask "fastlane"

# android...
cask "java"
cask "genymotion"
brew "gradle"
cask "android-file-transfer"
cask "android-platform-tools"
cask "android-sdk"
cask "android-studio"

cask "prey"
