tap "caskroom/cask"

brew "git"
brew "ghi"
brew "hub"
brew "mas"

brew "yarn"
brew "Schniz/tap/fnm"

brew "rbenv"

cask "gpg-suite"
mas "Flycut", id: 442160987

cask "iterm2"
cask "visual-studio-code"
cask "rectangle"
cask "istat-menus"
cask "github"
mas "Tweetbot", id: 557168941
mas "The Unarchiver", id: 425424353
# mas "Xcode", id: 497799835
brew "watchman"
brew "trash"

cask "transmission"
cask "appcleaner"
cask "imageoptim"
cask "cyberduck"
cask "grandperspective"
cask "discord"
cask "telegram"
cask "vlc"
cask "kap"
cask "jubler"
cask "sketch"
cask "webtorrent"
mas "JPEGmini Pro", id: 887163276

cask "google-chrome" # for react-native debugging

brew "imagemagick"
brew "python"
brew "tree"

# android...
cask "java"
tap "AdoptOpenJDK/openjdk"
cask "AdoptOpenJDK/openjdk/adoptopenjdk8"
cask "genymotion"
brew "gradle"
cask "android-file-transfer"
cask "android-platform-tools"
cask "android-sdk"
cask "android-studio"

cask "steam"
mas "Pixelmator", id: 407963104
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
# mas "Final Cut Pro", id: 424389933
